src/CF/DataProcessors/СменаПутейКФайлам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>СменаПутейКФайлам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/CF/Catalogs/Изображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Изображения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Договора</xr:Item>
				<xr:Item>Catalog.Клиенты</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
				<xr:Item>Document.ДвиженияДенег</xr:Item>
				<xr:Item>Document.Инвентаризации</xr:Item>
				<xr:Item>Document.КорректировкиИРегистрацияОстатков</xr:Item>
				<xr:Item>Document.ПеремещенияТовара</xr:Item>
				<xr:Item>Document.ПланыПродаж</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.УстановкиЦен</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СвязанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОсновноеИзображениеОбъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаИзображение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаИзображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеИзображения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеВБазеДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПриОтображении</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКартинок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоГоризонтали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПоВертикали</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Копирайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/DataProcessors/СменаПутейКФайлам/Forms/Форма/Ext/Form/Module.bsl
// sza150112-1840

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗамену(Команда)
	
	Если НЕ ПустаяСтрока(ПодСтрокаКоторуюСледуетНайти) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет изменение путей.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ЧислоИзменений = ВыполнитьЗаменуНаСервере(ОтобратьГруппуИзображений, ПодСтрокаКоторуюСледуетНайти, ПодСтрокаНаКоторуюСледуетЗаменить);
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Всего изменений") + ": " + СокрЛП(ЧислоИзменений));
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗаменуНаСервере(Знач ОтобратьГруппуИзображений, Знач ПодСтрокаКоторуюСледуетНайти, Знач ПодСтрокаНаКоторуюСледуетЗаменить = "")
	
	Результат = 0;
	
	Если ЗначениеЗаполнено(ОтобратьГруппуИзображений) Тогда
		Изображения = Справочники.Изображения.Выбрать(ОтобратьГруппуИзображений);
	Иначе
		Изображения = Справочники.Изображения.Выбрать();
	КонецЕсли;
	
	Пока Изображения.Следующий() Цикл
		ИзображениеОбъект = Изображения.Ссылка.ПолучитьОбъект();
		Былизм = ЛОЖЬ;
		Если НЕ Найти(Изображения.ИмяФайлаИзображения, ПодСтрокаКоторуюСледуетНайти) = 0 Тогда
			ИзображениеОбъект.ИмяФайлаИзображения = СтрЗаменить(ИзображениеОбъект.РасширениеФайла, ПодСтрокаКоторуюСледуетНайти, ПодСтрокаНаКоторуюСледуетЗаменить);
			Былизм = ИСТИНА;
		КонецЕсли;
		
		Если НЕ Найти(Изображения.РасширениеФайла, ПодСтрокаКоторуюСледуетНайти) = 0 Тогда
			ИзображениеОбъект.РасширениеФайла = СтрЗаменить(ИзображениеОбъект.РасширениеФайла, ПодСтрокаКоторуюСледуетНайти, ПодСтрокаНаКоторуюСледуетЗаменить);
			Былизм = ИСТИНА;
		КонецЕсли;
		
		Если НЕ Найти(Изображения.СсылкаНаИзображение, ПодСтрокаКоторуюСледуетНайти) = 0 Тогда
			ИзображениеОбъект.СсылкаНаИзображение = СтрЗаменить(ИзображениеОбъект.РасширениеФайла, ПодСтрокаКоторуюСледуетНайти, ПодСтрокаНаКоторуюСледуетЗаменить);
			Былизм = ИСТИНА;
		КонецЕсли;
		
		Если Былизм Тогда
			ИзображениеОбъект.Записать();
			Результат = Результат + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		

КонецПроцедуры
